#Broadcasting
#ต่อจาก Numpy_Python/basicNumpy20.py ,คือการบวก ลบ คูณ หาร ยกกําลัง กัน กับ  array ขนาดที่เท่ากันเท่านั้น!!!
#เราสามารถทำการบวก ลบ คูณ หาร ยกกําลัง กัน กับ  array ขนาดไม่เท่ากัน ได้โดยใช้ Broadcasting *****

#ตัวอย่างของ broadcasting คือ ที่จะทำ *ไว้

# broadcasting คือการทำซ้ํา array ที่มีขนาดเล็กกว่า ทำให้มีขนาด array เท่ากับ array ขนาดใหญ่กว่า โดยการทำซ้ำ array ที่มีขนาดเล็กกว่า 
#ตัวดำเนินการทางคณิตศาสตร์
#คือการ บวก ลบ คูณ หาร ยกกําลัง และ การหารเอาเศษ
import numpy as np

#ทำแบบ array 1 มิติ 
a = np.arange(1,5) #สร้าง array 1 มิติ ,arange(start,stop,step)
print(a)    # [1 2 3 4]
#ลองคำนวณ
print(a+2)  # [3 4 5 6]
print(a-2)  # [-1  0  1  2]
print(a*2)  # [2 4 6 8]
print(a/2)  # [0.5 1.  1.5 2. ]
print(a%2)   # [1 0 1 0]
print(a**2) # [ 1  4  9 16]

print("-------------------")

#กรณีอยากเอา ก้อนarray 2 ตัว มาบวก ลบ คูณ หาร ยกกําลัง กันละ
#สร้าง array ชื่อ มาเพิ่มอีก ก้อน เช่น
b = np.arange(1,5) #สร้าง array 1 มิติ ,arange(start,stop,step)

print(a)
print(b)

print("-------------------")

#จะทำการบวก ลบ คูณ หาร ยกกําลัง กันได้ต้องมีขนาด array ของ a และ b ต้องเท่ากัน!!!!!
print(a.shape)#แสดงขนาดของ array
print(b.shape)#แสดงขนาดของ array


print("-------------------")
#เช่นกรณีขนาดของ array ไม่เท่ากัน เช่น
c = np.arange(1,10) #สร้าง array 1 มิติ ,arange(start,stop,step)

print(c)
print(c.shape)

print("-------------------")

#ลองทำการบวก ลบ คูณ หาร ยกกําลัง กัน กับ  array ขนาดไม่เท่ากัน จะได้ error
# print(a+c) 
#ผลลัพธ์ error

#ทำแบบ array 2 มิติ ******
x = np.array([[1,2,3,4],[5,6,7,8]])
y = np.array([[9,10,11,12],[13,14,15,16]])

#เช็คขนาดของ array
print(x.shape)
print(y.shape)

print("-------------------")

#การหาร จะหารด้วย 0 ไม่ได้
# print(x/y)

#ลองทำการบวก ลบ คูณ หาร ยกกําลัง
print(x+y)
print(x-y)
print(x*y)
print(x/y)
print(x%y)
print(x**y)

print("-------------------")

#****************************
#ตัวอย่างของ broadcasting ******
print("ตัวอย่างของ broadcasting")

#ถ้าอยาก x ไปบวกกับ array ก้อนนึงเช่น
print(x+[2]) 

print("-------------------")
#สามารถทำได้ เพราะ สมาชิกของ array ของ x มีค่าเท่ากับ 1,2,3,4 
# แต่ถ้าอยาก y ไปบวกกับ array ก้อนนึงเช่น
# print(y+[2])

z = np.array([1,2])
print(z)
print(z.shape)

print("-------------------")
print(x)
print(x.shape)

print("-------------------")
#ลองทำการบวก
# print(x+z) #ผลลัพธ์ error เพราะขนาดของ array ไม่เท่ากัน ,x มีขนาด 2 มิติ แต่ z มีขนาด 1 มิติ
# print(z+x) #ผลลัพธ์ error เพราะขนาดของ array ไม่เท่ากัน ,x มีขนาด 2 มิติ แต่ z มีขนาด 1 มิติ

#ถ้าลองเปลี่ยนรูปแบบ ของ z ใหม่ 
z = np.array([1,2,3,4]) #ทำให้มีสมาชิก 4 ตัวเท่ากับ x
print(z)
print(z.shape)

print("-------------------")
#ลองทำการบวก
print(x)
#เอาแถว บวก แถว กับ คอลัมน์ บวก คอลัมน์
print(x+z) #ผลลัพธ์ คือ การบวก array 2 มิติ กับ array 1 มิติ ที่มีสมาชิก 4 ตัว เท่ากัน สามารถทำได้


print("-------------------")