#Append & Insert คือการเพิ่ิมข้อมูลให้กับสมาชิกใน array ใช้คําสั่ง .insert คล้ายกับคําสั่ง .append แต่จะมีลักษณะพิเศษกว่า คือ
#สามารถระบุตัว index ที่ต้องการเพิ่มข้อมูลใน array ได้ และสามารถเพิ่มข้อมูลใน array ได้มากกว่า 1 สมาชิก 
#สรุป คือ insert แปลว่า แทรก ,มันเลือกตําแหน่งที่เราต้องการเพิ่มข้อมูลใน array 
#append คือการต่อท้ายข้อมูลใน array เป็น สมาชิกตัวใหม่ 

import numpy as np

a =np.array([1,2,3,4,5,6,7,8])

print("ดูข้อมูลใน array ได้ดังนี้")
print(a)
print("----------------------------------")
#append
#ลอง append คือ การเพิ่มสมาชิกมาต่อท้าย array มาก่อน

print("ผลลัพธ์ของการappend สมาชิก array ได้ดังนี้")
#อยากเพิ่ม 40 มาต่อท้าย array a
print(np.append(a,40))

print("----------------------------------")

#insert
#ลอง insert คือ การinsert หรือ แทรกสมาชิกใน array ในตําแหน่งที่เราต้องการ

#เช่นเรา อยากแทรก เลข 10 ใน index หรือ ตำแหน่ง ที่ 1 

print("ผลลัพธ์ของการinsert สมาชิก array ได้ดังนี้")
#index เริ่มจาก 0 
print(np.insert(a,1,10)) #np.insert(array,ตําแหน่งที่ต้องการเพิ่ม,สมาชิกที่ต้องการเพิ่ม)

print("----------------------------------")

#เรา สามารถ แทรกได้หลากหลาย ตำแหน่ง 
#เช่น อยากแทรก เลข 100 ที่ index ที่ 1 และ 3

print("ผลลัพธ์ของการinsert สมาชิก array ได้ดังนี้")
#index เริ่มจาก 0 
print(np.insert(a,(1,3),100)) #np.insert(array,ตําแหน่งที่ต้องการเพิ่ม,สมาชิกที่ต้องการเพิ่ม)