#สร้าง Matrix ,OneMatrix  หรือเรียกว่า Array 1 ก็ได้ = Matrix 1 คือมีสมาชิกเป็น 1 ทั้งหมด

import numpy as np #เรียกใช้ numpy แล้วตั้งชื่อ numpy เป็น np

a = np.ones(5) #5 คือจำนวนสมาชิก มี 1 ทั้งหมด 5 ตัว
print(a)
#ผลลัพธ์ จะเป็น [1., 1., 1. ,1. ,1.]

#หรือกำหนดชนิดให้มันด้วย
a = np.ones(5,dtype='int')
print(a)

print("----------------------------------------------------------")
#สร้างแบบ 2 มิติ
b = np.ones((2,2)) #สร้าง matrix 2 มิติ 2x2
print(b)
#ผลลัพธ์ จะเป็น [[1. ,1.] [1., 1.]]

#หรือ แบบ 3 x 4
b= np.ones((3,4)) #แบบ tuple
print(b)
#เขียนแบบนี้ก็ได้ 
b= np.ones([3,4]) #แบบ list
print(b)

#หรือกำหนดชนิดให้มันด้วย
b = np.ones((3,4),dtype='int')
print(b)

print("----------------------------------------------------------")
#สร้างแบบ 3 มิติ
c = np.ones((2,3,4)) #สร้าง matrix 3 มิติ 2x3x4
print(c)
#ผลลัพธ์ จะเป็น [[[1. ,1. ,1. ,1.] [1. ,1. ,1. ,1.] [1. ,1. ,1. ,1.]] [[1. ,1. ,1. ,1.] [1. ,1. ,1. ,1.] [1. ,1. ,1. ,1.]]]