#index Operator คือการสร้าง array ที่มีข้อมูลภายในเป็นหมายเลข index
#สร้าง array 2 ก้อนมาเพื่อเปรียบเทียบการทํางานของ index operator

#เรียกใช้ numpy ในการสร้าง array หรือ มันคือ Numpy array
import numpy as np #ตั้งชื่อ numpy เป็น np

#กลุ่มแรก 
#array ทั่วไป
a = np.arange(1,10) #สร้าง array 1 มิติ ที่สามารถระบุช่วงตัวเลขได้ , =ช่วง 1 ถึง 10
print(a)

print("--------------------------------------------")
#กลุ่มที่สอง
#array ที่จะนำไปใช้งานกับ array กลุุ่่มแรก
#สร้าง index ให้เก็บสมาชิก
index = np.array([1,5,7]) #สร้าง array 1 มิติ ที่สามารถระบุช่วงตัวเลขได้ , =ช่วง 0 ถึง 2
# print(index)#ผลลัพธ์ [1 5 7]

#ลองมาใน array 1 มิติ *******************
#อยากเอาทั้ง2 กลุ่มมาทำงานร่วมกัน ,เอา array มาซ้อนกัน
a[index] #aคือเอาไว้ระบุสมาชิกหลายๆค่าโดยอ้างอิงมาจากตัวแปร index
print(a[index]) #มันคือเข้าถึง array ที่ชื่อ a และเอาเฉพาะ ตำแน่งที่อยู่ใน index คือ [1,5,7] ผลลัพธ์จะเป็น [2,6,8]
#*********อธิบาย******
#ปกติเอาต้องระบุทีละอัน เช่น a[index[0]] ,a[index[1]] ,a[index[2] หรือ x[2] ,x[4] และ x[6] 
# แต่ตอนนี้เรา เอาใส่เป็น x[index] ในตัวแปร index แล้วเอามาใส่เป็น x[index] แล้้วระบุตำแหน่งที่ต้องการลงไป แล้วเอามาเพื่อนําไปใช้งาน
print("--------------------------------------------")

#ลองมาใน array 2 มิติ *******************
#อยากเอาทั้ง2 กลุ่มมาทำงานร่วมกัน ,เอา array มาซ้อนกัน
b=np.array([[1,2,3],[4,5,6],[7,8,9]]) #สร้าง array 2 มิติ

#ต้องการสมาชิกภายใน array ชื่อ b โดยอ้างอิงมาจากตัวแปร index เช่น อยากได้ ตำแหน่ง index ที่ 0 และ 2 ใน array 2 มิติ
#จะได้ print(b[[0,2]])

print(b) #แสดง array ทั้งหมด 

print("--------------------------------------------")

print(b[[0,2]]) #แสดง array ที่อยู่ใน index 0 และ 2
print("--------------------------------------------")

#หรือการโยน index หลายๆค่ามาซ้อนเป็น array  ลอง array ชื่อ a มาทำ เช่น
print(a[[1,5,7]]) #เรามาสทำเป็น array  2 มิติ จ่ากเดิม เป็น 1 มิติ

print("--------------------------------------------")

#หรือ อยากได้ แถวที่ 0 ถึง 2 และคอลัมน์ที่ 2 และ 0 ของ array 2 มิติ ชื่อตัวแปร b
print(b[[0,2],[2,0]])

print("--------------------------------------------")

#อยากได้เลข 2 กับ 8 ของ array ชื่อ b
print(b[[0,2],[1,1]])
print("--------------------------------------------")

#หรือ
#อยากได้เลข 2 กับ 8 ของ array ชื่อ b
print(b[[0,2],[1]])
print("--------------------------------------------")

#ลองปริ้น index ใน array ชื่อ a ทั้งหมด
print(a)
print("--------------------------------------------")

#อยากได้เลขในตำแหน่ง 2,3,4 หรืออยากได้ เลข 3,4,5
print(a[[2,3,4]])
print("--------------------------------------------")

#หรือเอาง่าย ๆ เราจะสร้าง ตัวแปร array ชื่อ y ตัวใหม่เพื่อใช้งานเก็บตำแหน่งที่ต้องการ
#ได้ผลลัพธ์เหมือนกัน 
y = np.array([2,3,4]) #อ้างอิงจาก array ชื่อ a

print(a[y])
print("--------------------------------------------")

#หรืออยากดึงข้อมูลใน array ชื่อ a  แล้วมาใช้งาน array ก้อนใหม่
#อยากดึง array ชื่อ a ตำแหน่ง ที่ 1,4 มาเพื่อนําไปใช้งาน กับ array ชื่อ m
m = a[[1,4,1,4,1,4,1,4,1,4]] #อ้างอิงจาก array ชื่อ a จำนวน 10 ตัว สลับเลข 2,5,2,5,2,5,2,5,2,5
print(m)

print("--------------------------------------------")

#เราสามารถกำหนดค่าทาง boolean ได้
x=np.array([[1,-2,3],[4,-5,6],[7,-8,9]])
#เราสามารถ กรองข้อมูลอย่างไรก็ได้ เช่น เอาแค่ค่าติดลบ
print(x[x<0])
print("--------------------------------------------")
#หรือ กรองข้อมูลอย่างไรก็ได้ เช่น เอาแค่ค่าบวก
print(x[x>0])
print("--------------------------------------------")
#หรือ เอาที่ค่ามากกว่า 2
print(x[x>2])
print("--------------------------------------------")
#หรือปรับเปลี่ยนค่า เอาค่าติดลบ หรือ ค่าน้อยกว่า 0 เปลี่ยนให้เป็น ค่า บวก มัน ลบคูณลบ จะเป็น บวก
print(x[x<0]*-1)
print("--------------------------------------------")

#หรือเอาไปทำอยากอื่น เช่น ค่าที่น้อยกว่า 0 ไปคูณ 2
print(x[x<0]*2)
print("--------------------------------------------")
# เช่น ค่าที่น้อยกว่า 0 ไปคูณ 2 ถ้าอยากให้ผลลัพธ์เป็นค่าบวกแทนติดลบ 
print(x[x<0]*-2)
print("--------------------------------------------")

#เอาไปยกกำลัง 2 
print(x[x<0]**2)
print("--------------------------------------------")