# การ insert array 2 มิติ 

import numpy as np

a = np.array([[1,2],[3,4]])

print("ดูข้อมูลใน array ได้ดังนี้")
print(a)

print("----------------------------------")
#ผลลัพธ์ของการต่อสมาชิก array ได้ดังนี้
#สามารถระบุได้ว่า อยากแนวแกนไหน แนวตั้ง คือ 0 และ axis = 0 และแนวนอน คือ axis = 1

#กรณีเพิ่ม หรือ แทรกเลข แค่ 1 ตัว ******

#เรา เอา 100 แทรก ใน index ที่ 1 ในแนวตั้ง
print(np.insert(a,1,100,axis=0)) #np.insert(array,ตําแหน่งที่ต้องการเพิ่ม,สมาชิกที่ต้องการเพิ่ม,แนวที่ต้องการเพิ่ม)

print("----------------------------------")
#เรา เอา 50 แทรก ใน index ที่ 1 ในแนวนอน
print(np.insert(a,1,50,axis=1))

print("----------------------------------")
#กรณีเพิ่ม หรือ แทรกเลข มากกว่า 1 ตัว *****

#เรา อยากเพิ่ม เลข 10 กับ 20 แทรก ใน index ที่ 1 ในแนวตั้ง
print(np.insert(a,1,[10,20],axis=0))

print("----------------------------------")
#เรา อยากเพิ่ม เลข 30 กับ 40 แทรก ใน index ที่ 1 ในแนวนอน
print(np.insert(a,1,[30,40],axis=1))

print("----------------------------------")

#ถ้าเป็น 3 มิติ จะมี axis=2 เพิ่มเข้ามาด้วย