#Linspace
#เป็นการสร้าง array 1 มิติ ที่สามารถระบุช่วงตัวเลขได้และกำหนดจํานวนสมาชิกโดยใช้คำสั่ง linspace
#กำหนดช่วงโดยเว้นระยะห่างเท่าๆกัน

#****เหมาะกับเอาไป plot กราฟ ******


import numpy as np #เรียกใช้ numpy ในการสร้าง array หรือ มันคือ Numpy array

a = np.linspace(1,10) #สร้าง array 1 มิติ ที่สามารถระบุช่วงตัวเลขได้ , =ช่วง 1 ถึง 10 
print(a)

b =np.linspace(1,5)#สร้าง array 1 มิติ ที่สามารถระบุช่วงตัวเลขได้ , =ช่วง 1 ถึง 5
print(b)

#กรณีอยากกําหนดจํานวนสมาชิก 
#np.linspace(ช่วงตัวเลข,ช่วงตัวเลข,จํานวนสมาชิก) ************

c= np.linspace(1,10,5) #กําหนดจํานวนสมาชิก 5 ตัว
print(c)

d = np.linspace(1,5,4) #กําหนดจํานวนสมาชิก 4 ตัว
print(d)

#กรณี ถ้าอยาก 1 และก่อนถึงเลข 5 แต่ไม่เอาเลข 5 เราจะกำหนกให้เป็น np.linspace(1,5,endpoints=False)
e = np.linspace(1,5,endpoint=False)
print(e)