#การเข้าถึงสมาชิก ใน array 1 มิติ (index)

import numpy as np #ตั้งชื่อ numpy เป็น np

a = np.array([1,2,3,4,5]) #สร้าง array 1 มิติ
print(a[0],"(อยากได้เลข 1)")
print(a[1],"(อยากได้เลข 2)")
print(a[2],"(อยากได้เลข 3)")
print(a[3],"(อยากได้เลข 4)")
print(a[4],"(อยากได้เลข 5)")

#อยากเอาค่ามาบวกกัน เช่น 2+3 =5 ใช้ index 0 และ index 1

print(a[0]+a[1],"(เอา index 0 และ index 1 มาบวกกัน)")

#หรือทำแบบindex ติดลบก็ได้
print(a[-1],"(อยากได้เลข 5)")
print(a[-2],"(อยากได้เลข 4)")
print(a[-3],"(อยากได้เลข 3)")
print(a[-4],"(อยากได้เลข 2)")
print(a[-5],"(อยากได้เลข 1)")

#อยากเอาค่ามาบวกกัน เช่น 2+3 =5 ใช้ index -1 และ index -2

print(a[-1]+a[-2],"(เอา index -1 และ index -2 มาบวกกัน)")

#อยากเอาค่ามาบวกกัน เช่น 2+3 =5 ใช้ index 0 และ index -1

print(a[0]+a[-1],"(เอา index 0 และ index -1 มาบวกกัน)")

#ลองทำแบบตัวเลขไม่เรียงลำดับ
b= np.array([500 ,200, 4 ,6,19 ,20 ,3000])#สร้าง array 1 มิติ

print(b[4],"(อยากได้เลข 19)")
print(b[0],"(อยากได้เลข 500)")

#หรือทำแบบindex ติดลบก็ได้
print(b[-1],"(อยากได้เลข 3000)")
print(b[-2],"(อยากได้เลข 20)")

#เอาค่ามาบวกกัน
print(b[0]+b[-1],"(เอา index 0 และ index -1 มาบวกกัน)")