#Slice Array 1 มิติ **************
#การเข้าถึงข้อมูลสมาชิกภายใน array แบบ slice
#Slice การทำงานคล้ายกับการเข้าถึงข้อมูลสมาชิกภายใน list เลยยยยย!!!
#เช่น อยากได้ ค่า 1-4 เราสามารถ Slice ออกมาเพื่อดูข้อมูลภายใน list ได้ Array ก็เหมือนกัน

import numpy as np #เรียกใช้ numpy 

a =np.arange(1,11)#สร้าง array 1 มิติ ที่สามารถระบุช่วงตัวเลขได้ , =ช่วง 1 ถึง 10 , มันคือ np.arange(start,stop,step,dtype)
print(a)

#อยากได้เลข 3 ทำในรูปแบบ index
print(a[2])

#****ทำรูปแบบ slice มีทั้งหมด 5 รูปแบบ****
#แบบที่ 1 คือ ไม่ทำการระบุค่าอะไรเลย มันจำการนับสมาชิกแรกถึงสมาชิกสุดท้าย โดยใช้คำสั่ง [ : ]
print(a[:]) #a[:] #แบบที่ 1 ,มันจะแสดงข้อมูลทั้งหมด

#แบบที่ 2 คือ สามารถระบุช่วงตัวเลขได้ อันนี้จะระบุแค่เลขเริ่มต้นก่อน, มันจะแสดงข้อมูลตามช่วงที่ระบุไว้ โดยใช้คำสั่ง [ start : ]
print(a[2:])#a[2:] #แบบที่ 2 , มันจะแสดงข้อมูลตั้งแต่สมาชิกที่ 2 ถึงสมาชิกสุดท้าย
#หรือ
print(a[:4])#a[:4] #แบบที่ 2 , มันจะแสดงข้อมูลตั้งแต่สมาชิกแรกถึงสมาชิกที่ 4 ,index 0 ถึง 3

#แบบที่ 3 คือ สามารถระบุช่วงตัวเลขได้ อันนี้จะระบุแค่เลขสุดท้าย, มันจะแสดงข้อมูลตามช่วงที่ระบุไว้ โดยใช้คำสั่ง [: stop  ]
print(a[:6])#a[:6] #แบบที่ 3 , มันจะแสดงข้อมูลตั้งแต่สมาชิกแรกถึงสมาชิกที่  6 ,ผลลัพธ์จะเป็น [1 2 3 4 5 6] ,index 0 ถึง 5

#หรือลองตัวเลขอื่น
b = np.array([20,10,30,50,40]) #สร้าง array 2 มิติ
print(b)
#อยากได้ เลข 10,30,50,40
print(b[1:]) #b[1:] #แบบที่ 4 , มันจะแสดงข้อมูลตั้งแต่สมาชิกที่ 1 ถึงสมาชิกสุดท้าย
#อยากได้ 50,40
print(b[3:]) #b[3:] #แบบที่ 4 , มันจะแสดงข้อมูลตั้งแต่สมาชิกที่ 3 ถึงสมาชิกสุดท้าย
#หรือระบุแบบ แค่ตัวสุดท้าย
print(b[:4]) #b[:4] #แบบที่ 4 , มันจะแสดงข้อมูลตั้งแต่สมาชิกแรกถึงสมาชิกที่ 4

#แบบที่ 4 คือ กำหนดช่วงตัวเลข ที่ต้องระบุ ตัวเลขเริ่มต้นและสุดท้าย , มันจะแสดงข้อมูลตามช่วงที่ระบุไว้ โดยใช้คำสั่ง [ start : stop ]
print(a[2:6])#a[2:6] #แบบที่ 4 , มันจะแสดงข้อมูลตั้งแต่สมาชิกที่ 2 ถึงสมาชิกที่ 6
#หรือ
print(a[3:7])#a[3:7] #แบบที่ 4 , มันจะแสดงข้อมูลตั้งแต่สมาชิกที่ 3 ถึงสมาชิกที่ 7
#อยากได้ เลข 2-9
print(a[2:9])#a[2:9] #แบบที่ 4 , มันจะแสดงข้อมูลตั้งแต่สมาชิกที่ 2 ถึงสมาชิกที่ 9


#ความหมาย b[start:stop-1] หรือ b[start:end -1] ต้อง ลบ 1 เพราะมันจะไม่แสดงสมาชิกสุดท้าย ,และ indexเริ่มที่ 0 


#แบบที่ 5 คือเพิ่ม step เข้ามา เป็น a[ start : stop : step ] ,step คือ อัตราการเพิ่มข้อมูล ,กระโดดข้ามสมาชิกตามเลขที่ระบุไว้
print(a[2:9:2]) #เพิ่ม step 2 แล้วแสดงข้อมูลตั้งแต่สมาชิกที่ 2 ถึงสมาชิกที่ 9 แต่ละข้าม 2 ข้อมูล

#อยากทำแบบ เพิ่มทีละ 2 step
c =np.array([10,30,40,50,60,70,75,90])
print(c[:])#แสดงข้อมูลทั้งหมด
print(c[::2])#แสดงข้อมูลทั้งหมดแต่ละข้าม 2 ข้อมูล 
#ผลลัพธ์จะเป็น [10 40 60 90] เพราะมันแสดงข้อมูลทั้งหมดแต่ละข้าม 2 ข้อมูล มันนับ 10 ,30 เป็น 2 ขั้น แล้วได้เลข 40 มา

#อยากทำแบบ เพิ่มทีละ 3 step
print(c[::3])#แสดงข้อมูลทั้งหมดแต่ละข้าม 3 ข้อมูล

#******
#แบบพิเศษ หรือแบบพิมพ์ถอยหลัง คือ กําหนด step เป็น -1 คือ หลังสุดท้ายเป็นหน้าตัวแรก
print(a[2:9:-1]) #ผลลัพธ์จะเป็น [8 7 6 5 4 3] 