#การแบ่งสมาชิก ใน array (split) โดยใช้คำสั่ง .split
#หรือการแบ่งข้อมูลใน array เป็นส่วนๆ โดยใช้คำสั่ง .split
#การ split คือการแบ่งข้อมูลเป้นกลุ่มๆ สมาชิกเท่าๆกัน

#เช่น มีข้อมูล 20 ตัว อยากแบ่งให้เป็น 4 กลุ่ม จะได้กลุ่มละ 5 ตัว
#สำคัญ *** การแบ่ง ต้องสอดคล้องกับจำนวนสมาชิกด้วย ว่าแบ่งได้ไหม 

import numpy as np
#แบบ array 1 มิติ
print("แบบ array 1 มิติ")

a = np.arange(1,21) #สร้าง array 1 มิติ ที่สามารถระบุช่วงตัวเลขได้ , =ช่วง 1 ถึง 20

print("ดูข้อมูลใน array ได้ดังนี้")
print(a)

print("----------------------------------")

#แบ่งสมาชิกใน array ได้ดังนี้

print("ผลลัพธ์ของการแบ่งสมาชิก array ได้ดังนี้")

#ต้องการแบ่ง เป็น 4 ส่วน
print(np.split(a,4)) #np.split(arrayที่เราต้องการแบ่ง,จํานวนสมาชิกที่ต้องการแบ่งเป็น กี่ส่วน)

print("----------------------------------")

#ต้องการแบ่ง เป็น 3 ส่วน
# print(np.split(a,4)) #np.split(arrayที่เราต้องการแบ่ง,จํานวนสมาชิกที่ต้องการแบ่งเป็น กี่ส่วน)
#ผลลัพธ์ จะ error เพราะ ไม่สามารถแบ่งเป็น 3 ส่วนได้ เพราะ ไม่สอดคล้องกับจำนวนสมาชิกด้วย

#ต้องการแบ่ง เป็น 5 ส่วน
print(np.split(a,5)) #np.split(arrayที่เราต้องการแบ่ง,จํานวนสมาชิกที่ต้องการแบ่งเป็น กี่ส่วน)

print("----------------------------------")

#แบบ array 2 มิติ
print("แบบ array 2 มิติ")

x = np.arange(1,21).reshape(5,4) #reshape(แถว,คอลัมน์) คือการเปลี่ยนแปลงรูปแบบของ array

print("ดูข้อมูลใน array ได้ดังนี้")
print(x)

print("----------------------------------")

#แบ่งสมาชิกใน array ได้ดังนี้
#การแบ่ง ในarray 2 มิติ ต้องระบุ แกนที่ต้องการแบ่งด้วย hsplit คือ horizontal split แกนแนวนอน
#vsplit คือ vertical split แกนแนวตั้ง 

print("ผลลัพธ์ของการแบ่งสมาชิก array ได้ดังนี้")

#ต้องการแบ่ง เป็น 4 ส่วน ในคอลัมน์ คือแนวตั้ง
print("ผลลัพธ์ของการแบ่งสมาชิก array ได้ดังนี้ แบบแนวตั้ง")
print(np.hsplit(x,4)) #np.hsplit(arrayที่เราต้องการแบ่ง,จํานวนสมาชิกที่ต้องการแบ่งเป็น กี่ส่วน)

print("----------------------------------")

#ต้องการแบ่ง เป็น 5 ส่วน ในคอลัมน์ คือแนวนอน
print("ผลลัพธ์ของการแบ่งสมาชิก array ได้ดังนี้ แบบแนวนอน")
print(np.vsplit(x,5)) #np.hsplit(arrayที่เราต้องการแบ่ง,จํานวนสมาชิกที่ต้องการแบ่งเป็น กี่ส่วน)

print("----------------------------------")
