#ฟังก์ชั่นสถิติ 
#การใช้ array ทำงานร่วมกับ ค่าทางสถิติ ,numpy จะเกี่ยวกับค่าทางคณิตศาสตร์ รวมไปถึง สถิติด้วย
#อยากทำงานร่วมกับสถิติ เช่น ถ้าเราอยากหาผลรวม  ค่าต่ำสูงสุด หรือส่วน เบี่ยงเบนมาตรฐาน 
#หรือเช่น มาทำงานกับสถิตินิดๆหน่อยๆ เช่น อยากจะหาผลรวมarray 1 มิติ หรือ array 2 มิติ


import numpy as np

#แบบ array 1 มิติ *********

a = np.array([10,5,4,6,99,100,50,30])

print(a)

print("---------------------")
#a.sum()คือหาผลรวม
print(a.sum(),"ผลรวม") 

print("---------------------")
#ผลรวมของผลคูณ ,product ชื่อย่อคือ prod
print(a.prod(),"ผลรวมการคูณ")

print("---------------------")

#หาค่าเฉลี่ย 
print(a.mean(),"ค่าเฉลี่ย")

print("---------------------")

#ค่าสูงสด
print(a.max(),"ค่าสูงสุด")
print("----------------------")

#ค่าต่ำสุด
print(a.min(),"ค่าต่ำสุด")

print("----------------------")

#หาตำแหน่ง เช่น อยากรู้ว่า ค่าสูงสุดที่เราได้มานี้ อยู่ตำแหน่งที่เท่าไหร่ หรือ ตำแหน่งอะไร
print(a.argmax())

print("----------------------")


#หาตำแหน่ง เช่น อยากรู้ว่า ค่าต่ำสุดที่เราได้มานี้ อยู่ตำแหน่งที่เท่าไหร่
print(a.argmin())

print("----------------------")

#แบบ array 2 มิติ *********
#จะมีเรื่อง axis เข้ามาด้วย เป็นการระบุพิกัดแนวตั้งและแนวนอน ตามพิกัดที่เราต้องการ
#axis0 คือ แนวตั้ง , axis1 คือแนวนอน ,0 ตั้ง 1นอน

b=np.array([[10,20,30],[40,50,90],[80,100,5]])

print(b ,"แสดงarray B")

print("----------------------")

#เราอยากหาค่าต่ำสุด(min)ใน array B แนวนอน คือ axis1
print(np.min(b,axis=1)) #np.min(array ที่เราจะทำงาน ,แนวที่เราอยากทำ)

print("---------------------")

#เราอยากหาค่าสูงสุด(max)ใน array B แนวนอน คือ axis1
print(np.max(b,axis=1)) #np.max(array ที่เราจะทำงาน ,แนวที่เราอยากทำ)

print("---------------------")

#เราอยากหาค่าต่ำสุดใน array B แนวตั้ง คือ axis0
print(np.min(b,axis=0)) #np.min(array ที่เราจะทำงาน ,แนวที่เราอยากทำ)

print("---------------------")

#เราอยากหาค่าสูงสุดใน array B แนวตั้ง คือ axis0
print(np.max(b,axis=0)) #np.max(array ที่เราจะทำงาน ,แนวที่เราอยากทำ)

print("---------------------")