# #Slice Array 2 มิติ **************
# #การเข้าถึงข้อมูลสมาชิกภายใน array แบบ slice
# #x[start : stop : step]
#print(x[ตั้งแต่แถวที่ต้องการ : แถวที่่เลือก , ตั้งแต่คอลัมที่ต้องการ : คอลัมที่่เลือก]) ******


import numpy as np #เรียกใช้ numpy 

x =np.array([[1,2,3], #row 0
            [4,5,6], #row 1
            [7,8,9]])#สร้าง array 2 มิติ ,row 2
print(x)
print("----------------------------------------------------------")

# #การเข้าถึงข้อมูลมาชิกภายใน array 2 มิติ แบบ slice
# #มีทั้งหมด 5 รูปแบบ
# #1.แบบไม่ระบุค่าอะไรเลย
print(x[:,:]) #x[:,:] #แบบที่ 1 ,มันจะแสดงข้อมูลทั้งหมด

#print(x[ตั้งแต่แถวที่ต้องการ : แถวที่่เลือก , ตั้งแต่คอลัมที่ต้องการ : คอลัมที่่เลือก]) ******
print("แสดงข้อมูลทั้งหมด")
print("แสดงแบบที่ 1")

print("----------------------------------------------------------")

# #2.แบบระบุค่าเริ่มต้น x[start(ของ row):,start(ของ column): ]
print(x[1:,1:]) #x[1:,1:] #แบบที่ 2 ,มันจะแสดงข้อมูลตั้งแต่สมาชิกที่ 1 ถึงสมาชิกสุดท้าย
print(x[2:,2:])#อยากได้เลข  9
# #อยากได้เลข 8 ,9
print(x[2:,1:])
# #เอาเฉพาะคอลัมที่ 2
print(x[:,2:])
print("แสดงแบบที่ 2")
print("----------------------------------------------------------")

# #3.แบบระบุค่าสิ้นสุด x[ stop(ของ row),: stop(ของ column)]
print(x[:2,:2]) #x[:2,:2] #แบบที่ 3 ,มันจะแสดงข้อมูลตั้งแต่สมาชิกแรกถึงสมาชิกที่ 2
# #เอาเฉพาะแถวที่ 2
print(x[:2,:])
# #เอาเลขที่ 1 - 6
print(x[:2,:])
# #อยากได้แถวที่ 0 และแถวที่ 1 แต่เอาเฉพาะคอลัมที่ 2 คือ [[3], [6]]
print(x[:2,2:]) #คือเอาแถวก่อนหน้า : และแถวที่ 1 หรือ แถวก่อนถึงแถวที่ 2  แต่เอาเฉพาะคอลัมที่ 2
print("แสดงแบบที่ 3")

print("----------------------------------------------------------")

# #4.แบบระบุค่าเริ่มต้นและสิ้นสุด x[start(ของ row) : stop(ของ row) , start(ของ column): stop(ของ column)]
print(x[1:2,1:2]) #จะได้เลข 5 คือเอาแถวที่ 1 ถึงแถวที่ 2 และเอาคอลัมที่ 1 ถึงคอลัมที่ 2

print("แสดงแบบที่ 4")
print("----------------------------------------------------------")

# #5.แบบระบุค่าเริ่มต้นและสิ้นสุดและระบุ step 
# # , x[start(ของ row): stop(ของ row) : step(ของ row) , start(ของ column): stop(ของ column) : step(ของ column)]
print(x[1:2:1,1:2:1]) #จะได้เลข 5 คือเอาแถวที่ 1 ถึงแถวที่ 2 และเอาคอลัมที่ 1 ถึงคอลัมที่ 2
#ต้องการเฉพาะแถวคี่ คือ เอาแถวแรกและแถวสุดท้าย
print(x[:,:])#อันนี้คือเอาทุกแถวและทุกคอลัม
#เลยเพิ่มเรื่อง step เข้ามา
print(x[::2, :] ) #::2 start คือ 0 เป็น : stop คือ 0 เป็น :  step เพิ่มทีละ2 เป็น 2
#ถ้าเราอยากได้เลขคู่ละ คือเอาแค่แถวคู่ คือแถวindex ที่ 1 เอาทุกคอลัม
print(x[1:2,:]) #เอาแถวที่ 1 ถึงแถวก่อนถึงแถวที่ 2 และเอาทุกคอลัม
#ถ้าอยากได้คอลัมเลขคี่ละ เอาคอลัมแรกและคอลัมสุดท้าย
print(x[::,::2]) #::, คือเอาทุกแถว ::2 คือเอาคอลัมแรกและคอลัมสุดท้าย
#ต้องการแถวทุกแถวแต่แค่คอลัมที่2 มันคือ index ที่ 1
print(x[::,1:2]) #1:2 คือเอาคอลัมที่ 1 ถึงคอลัมก่อนถึงคอลัมที่ 2 ก็คือไม่เอาคอลัมที่ 2


print("แสดงแบบที่ 5")
print("----------------------------------------------------------")