#สร้าง Matrix ,Zero Matrix  หรือเรียกว่า Array 0 ก็ได้ = Matrix 0

import numpy as np #เรียกใช้ numpy แล้วตั้งชื่อ numpy เป็น np

#สร้างแบบ 1 มิติ
a=np.zeros(5) #5 คือจำนวนสมาชิก มี 0 ทั้งหมด 5 ตัว
print(a)
#ผลลัพธ์ จะเป็น [0., 0., 0. ,0. ,0.]

#หรือกำหนดชนิดให้มันด้วย
a = np.zeros(5,dtype='int')
print(a)

print("----------------------------------------------------------")
#สร้างแบบ 2 มิติ
b = np.zeros((2,2)) #สร้าง matrix 2 มิติ 2x2
print(b)
#ผลลัพธ์ จะเป็น [[0. ,0.] [0., 0.]]

#หรือ แบบ 3 x 4
b= np.zeros((3,4)) 
print(b)
#เขียนแบบนี้ก็ได้ 
b= np.zeros([3,4])
print(b)

#หรือกำหนดชนิดให้มันด้วย
b = np.zeros((3,4),dtype='int')
print(b)

#**********************
#สร้างแบบ 3 มิติ
c = np.zeros((3,4,5)) #สร้าง matrix 3 มิติ 3x4x5
print(c)

