#index Operator คือการสร้าง array ที่มีข้อมูลภายในเป็นหมายเลข index
#สร้าง array 2 ก้อนมาเพื่อเปรียบเทียบการทํางานของ index operator

#เรียกใช้ numpy ในการสร้าง array หรือ มันคือ Numpy array
import numpy as np #ตั้งชื่อ numpy เป็น np

#กลุ่มแรก
a = np.arange(1,10) #สร้าง array 1 มิติ ที่สามารถระบุช่วงตัวเลขได้ , =ช่วง 1 ถึง 10
print(a)

#กลุ่มที่สอง
#สร้าง index ให้เก็บสมาชิก
index = np.array([1,5,7]) #สร้าง array 1 มิติ ที่สามารถระบุช่วงตัวเลขได้ , =ช่วง 0 ถึง 2
print(index)

#อยากเอาทั้ง2 กลุ่มมาทำงานร่วมกัน ,เอา array มาซ้อนกัน
a[index] #aคือเอาไว้ระบุสมาชิกหลายๆค่าโดยอ้างอิงมาจากตัวแปร index
print(a[index]) #มันคือเข้าถึง array ที่ชื่อ a และเอาเฉพาะ ตำแน่งที่อยู่ใน index คือ [1,5,7] ผลลัพธ์จะเป็น [2,6,8]
#*********อธิบาบ******
#ปกติเอาต้องระบุทีละอัน เช่น a[index[0]] ,a[index[1]] ,a[index[2] หรือ x[2] ,x[4] และ x[6] 
# แต่ตอนนี้เรา เอาใส่เป็น x[index] ในตัวแปร index แล้วเอามาใส่เป็น x[index] แล้้วระบุตำแหน่งที่ต้องการลงไป แล้วเอามาเพื่อนําไปใช้งาน