#matrix ค่าคงที่ (Full) ,หรือเรียกว่า Array ค่าคงที่ มันคือกรณีไม่อยากทำเป้นเลขอื่นที่ไม่ใช่ 0 หรือ 1

import numpy as np  #เรียกใช้ numpy แล้วตั้งชื่อ numpy เป็น np

#แบบ 1 มิติ
a1 = np.full(5,10) #5 คือจำนวนสมาชิก มี เลข 10 ทั้งหมด 5 ตัว
print(a1)
#ผลลัพธ์ จะเป็น [10., 10., 10. ,10. ,10.]
a2 = np.full(5,7) # 5 คือจำนวนสมาชิก มี เลข 7 ทั้งหมด 5 ตัว
print(a2)
#ผลลัพธ์ จะเป็น [7., 7., 7. ,7. ,7.]
a3 =np.full(5,10,dtype='int') #หรือเขียนแบบนี้ก็ได้ , แปลงชนิดข้อมูลของ array `a` เป็น int
print(a3)
print("----------------------------------------------------------")
#แบบ 2 มิติ
b1 = np.full((2,2),7) #สร้าง matrix 2 มิติ 2x2 มีค่าคงที่ 7
print(b1)
#ผลลัพธ์ จะเป็น [[7. ,7.] [7., 7.]]ื
b2 = np.full([4,5],7) #เขียนแบบนี้ก็ได้
print(b2)
#ผลลัพธ์ จะเป็น [[7., 7., 7., 7., 7.] [7., 7., 7., 7., 7.] [7., 7., 7., 7., 7.] [7., 7., 7., 7., 7.]]

#ทำเป็นทศนิยมก็ได้
b3 = np.full([4,5],7.5)
print(b3)
#ผลลัพธ์ จะเป็น [[7.5, 7.5, 7.5, 7.5, 7.5] [7.5, 7.5, 7.5, 7.5, 7.5] [7.5, 7.5, 7.5, 7.5, 7.5] [7.5, 7.5, 7.5, 7.5, 7.5]]  
print("----------------------------------------------------------")