#EMTRY ,มันคือการสร้าง array ที่ไม่่มีสมาชิก โดยระบุขนาด และใช้ np.empty()

import numpy as np #เรียกใช้ numpy ในการสร้าง array หรือ มันคือ Numpy array

#สร้าง array 1 มิติ
a = np.empty((5)) 
print(a)
#ผลลัพธ์ จะเป็น [0. 0. 0. 0. 0.] ,มันจะสุ่มค่าให้เรา เพราะมันไม่มีสมาชิก เราไม่ระบุค่าให้มัน

#สร้าง array 2 มิติ
b = np.empty([3,4])
print(b)
#ผลลัพธ์ จะสุ่มค่าให้เรา เพราะมันไม่มีสมาชิก เราไม่ระบุค่าให้มัน ลองสั่งเทียบกับ c ดูว่าผลลัพธ์จะเหมือนกันไหมเขียนเหมือนกันแค่เก็บคนละตัวแปร

c = np.empty((3,4))
print(c)

#สร้าง array 3 มิติ
d = np.empty([3,4,5])
print(d)
#ผลลัพธ์ จะสุ่มค่าให้เรา เพราะมันไม่มีสมาชิก เราไม่ระบุค่าให้มัน

