#Transpose ,matrix ,มันคือการเปลี่ยนแกน จากแกนแนวตั้ง เป็นแกนแนวนอน หรือ จากแกนแนวนอน เป็นแกนแนวตั้ง
#ส่วนใหญ่ใช้ array 2 มิติ

import numpy as np
a = np.array([[1,2,3],[4,5,6]])
print(a,"ต้นฉบับ") #ดูโครงสร้างของ array

#Transpose
print(a.T,"แบบที่ transpose")

print("----------------------------------------------------------")
#หรือ แบบนี้ ก็ได้
print(np.transpose(a))

print("----------------------------------------------------------")
#หรือ แบบนี้ก็ได้
print(a.transpose(),"-ที่เปลี่ยนแปลงค่าแบบชั่วคราว")

print("----------------------------------------------------------")
#แต่ข้างต้น จะไม่เปลี่ยนแปลงค่าถาวร แต่เปลี่ยนแปลงค่าถาวรให้ เก็บไว้ในตัวแปรใหม่ เช่น เก็บ a.T ไว้ใน b

b = a.transpose()
print(b ,"- ที่เปลี่ยนแปลงค่าถาวร")

print("----------------------------------------------------------")
#หรือ แบบนี้ก็ได้
b = np.transpose(a)
print(b)

#ดูขนาด array ของ a 
print(a.shape,"- ของ a")
#ดูขนาด array ของ b
print(b.shape,"- ของ b")

