#การลบสมาชิก ใน array โดยใช้คำสั่ง .delete
#ยกตัวอย่าง array 1 มิติ และ array 2 มิติ

import numpy as np
#แบบ array 1 มิติ
print("แบบ array 1 มิติ")

a = np.arange(1,10)
print("ดูข้อมูลใน array ได้ดังนี้")
print(a)

print("----------------------------------")
#ลบสมาชิกใน array ได้ดังนี้

print("ผลลัพธ์ของการลบสมาชิก array ได้ดังนี้")

#ต้องการลบ สมาชิกที่ 2 คือเลข  3
print(np.delete(a,2)) #np.delete(arrayที่เราต้องการลบ,ตําแหน่งที่ต้องการลบ)

print("----------------------------------")

#array 2 มิติ ****
#แบบ array 2 มิติ ,ต้องระบุ แถวและคอลัมน์ หรือ คือแกน แนวตั้งหรือ แนวนอน

print("แบบ array 2 มิติ")

b = np.arange(1,13).reshape(4,3) 
#reshape(แถว,คอลัมน์) คือการเปลี่ยนแปลงรูปแบบของ array   แบบ array 2 มิติ ,ต้องระบุ แถวและคอลัมน์

print("ดูข้อมูลใน array ได้ดังนี้")
print(b)

print("----------------------------------")
#ลบสมาชิกใน array ได้ดังนี้

print("ผลลัพธ์ของการลบสมาชิก array ได้ดังนี้")

#อยาก ลบ array b ตำแหน่งหรือ index ที่ 2 ในแนวตั้ง
print("อยาก ลบ array b ตำแหน่งหรือ index ที่ 2 ในแนวตั้ง")
print(np.delete(b,2,0)) #np.delete(arrayที่เราต้องการลบ,ตําแหน่งที่ต้องการลบ,แกนแนวตั้ง)

print("----------------------------------")
#หรือเขียนแบบนี้ก็ได้
print(np.delete(b,2,axis=0))

print("----------------------------------")
#อยาก ลบ array b ตำแหน่งหรือ index ที่ 2 ในแนวนอน
print("อยาก ลบ array b ตำแหน่งหรือ index ที่ 2 ในแนวนอน")

print(np.delete(b,2,1)) #np.delete(arrayที่เราต้องการลบ,ตําแหน่งที่ต้องการลบ,แกนแนวนอน) 

print("----------------------------------")
#หรือเขียนแบบนี้ก็ได้
print(np.delete(b,2,axis=1))

print("----------------------------------")

#อยาก ลบ array b ตำแหน่งหรือ index ที่ 0 ในแนวตั้ง
print("อยาก ลบ array b ตำแหน่งหรือ index ที่ 0 ในแนวตั้ง")

print(np.delete(b,0,0)) #np.delete(arrayที่เราต้องการลบ,ตําแหน่งที่ต้องการลบ,แกนแนวตั้ง) 

print("----------------------------------")
#หรือเขียนแบบนี้ก็ได้
print(np.delete(b,0,axis=0))

print("----------------------------------")

#อยาก ลบ array b ตำแหน่งหรือ index ที่ 0 ในแนวนอน
print("อยาก ลบ array b ตำแหน่งหรือ index ที่ 0 ในแนวนอน")

print(np.delete(b,0,1)) #np.delete(arrayที่เราต้องการลบ,ตําแหน่งที่ต้องการลบ,แกนแนวนอน) 

print("----------------------------------")
#หรือเขียนแบบนี้ก็ได้
print(np.delete(b,0,axis=1))

print("----------------------------------")
#ถ้าเป็น 3 มิติ จะมี axis=2 เพิ่มเข้ามาด้วย