#Flatten ,lavel คือ การเปลี่ยนแปลง array หลายมิติ ให้เหลือเพียงมิติเดียวโดยใช้คำสั่ง flatten กับ lavel
#หรือ เช่น เราอยากเปลี่ยนแปลง array 3 มิติ ให้เป็น 2 มิติ ก็ใช้คำสั่ง flatten กับ lavel หรือให้เป็น 1 มิติ ก็ใช้คำสั่ง flatten กับ lavel

#Flatten คือการเปลี่ยนแปลง array หลายมิติ ให้เหลือเพียงมิติเดียว แบบชั่วคราว *****

#Lavel คือการเปลี่ยนแปลง array หลายมิติ ให้เหลือเพียงมิติเดียว  *****

import numpy as np #เรียกใช้ numpy

a = np.array([[1,2],[4,5],[7,8]]) #สร้าง array 2 มิติ

print(a)
#อยากแปลง ให้เป็น 1 มิติ
print(a.flatten()) 

print(a)
#จะเห็นหา ถ้าprintแล้วจะreturn ค่าเดิม มันจะไม่เปลี่ยน ถาวร

#หรือสร้างตัวแปรมาเก็บ array ที่เปลี่ยนแปลงแล้วเพื่อให้มันเปลี่ยนแปลงแบบ ถาวร 

b = a.flatten()
print(b)

print(b[0])

#หรือใช้คำสั่ง lavel เพื่อเปลี่ยนแปลง array หลายมิติ ให้เหลือเพียงมิติเดียว แบบถาวร ***

c = a.ravel()
print(c)

print(c[0])#อยากได้เลข 1 
#ถ้าอยากเปลี่ยน เลขในตำแหน่ง 0 เป็นเลข 5
c[0] = 5
print(c[0])  #array ของ a จะเปลี่ยนแปลงตาม  แต่ array ของ b จะไม่เปลี่ยนแปลง ถูกตัดขาด

print(c,"เลขในตำแหน่ง 0 เป็นเลข 5จะเปลี่ยนแปลงตามที่กำหนด")

