#dot product การคูณmatrix ,การคูณสเกลาร์
#การนำข้อมูลใน array มาคูณกัน หรือ เมทริกซ์จัตุรัสมาดำเนินการคูณกันเพื่อให้ได้ผลลัพธ์ตามที่เราต้องการ 
# เรียกว่า "ผลคูณสเกลาร์" คือการข้อมูลแถวและข้อมูลคอลัมน์มาคูณกัน แล้วเก็บในarray
#สรุป คือ การคูณข้อมูลใน array มาดำเนินการคูณกัน แล้วเก็บในarray ***

import numpy as np #เรียกใช้ numpy แล้วตั้งชื่อ numpy เป็น np
#สร้างแบบ 1 มิติ

a = np.array([1,2,3,4])
b = np.array([5,6,7,8])
print("ดูข้อมูลใน array ได้ดังนี้")

print(a)
print(b)

print("_________________________")
print("ผลลัพธ์ จะเป็น 1*5 + 2*6 + 3*7 + 4*8 = 5 + 12 + 21 + 32 = 70")
print("แบบที่ 1")
#เอาค่ามาคูณกัน
print(np.dot(a,b))

print("แบบที่ 2")
#หรือทำแบบนี้ก็ได้

c = a.dot(b)
print(c)

print("-------------------------")

#สร้างแบบ 2 มิติ
d = np.array([[1,2],[3,4]])
e = np.array([[5,6],[7,8]])

print("ดูข้อมูลใน array ได้ดังนี้")
print(d)
print(e)

print("_________________________")
print("ผลลัพธ์ [[1*5 + 2*7 , 1*6 + 2*8], \n [3*5 + 4*7 , 3*6 + 4*8]] \n = [[5+14 , 6+16], \n [15+28, 18+32]] \n= [[19, 22],\n  [43, 50]]")
print("แบบที่ 1")
print(np.dot(d,e))

print("แบบที่ 2")
#หรือทำแบบนี้ก็ได้

f = d.dot(e)
print(f)

print("-------------------------")