#Concatenate คือ การต่อสมาชิก
#หรือคือการรวมarray เข้าด้วยกันด้วยคำสั่ง np.concatenate
#คือการรวม array 2 ชุดเข้าด้วยกัน

#append คือ การเพิ่มสมาชิกมาต่อท้าย array ใช้คําสั่ง .append

import numpy as np

#แบบ array 1 มิติ 

#สร้าง array มา 2 ชุด เพื่อนำมาต่อกัน
a = np.array([1,2,3,4])
b = np.array([5,6,7,8])

print("แบบ array 1 มิติ")
print("----------------------------------")
#แสดงผลลัพธ์
print("ดูข้อมูลใน array ได้ดังนี้")
print(a)
print(b)

print("----------------------------------")

#สร้าง ตัวแปร c เพื่อเก็บผลลัพธ์

print("ผลลัพธ์ของการต่อสมาชิก array ได้ดังนี้")

c = np.concatenate((a,b))
print(c)

print("----------------------------------")

#หรือแบบที่ไม่ต้องสร้างตัวแปรมาเก็บ คือ
d = np.array([3,4,2,6])
e = np.array([8,6,5,10])

print("ดูข้อมูลใน array ได้ดังนี้")
print(d)
print(e)

print("----------------------------------")

#แสดงผลลัพธ์
print("ผลลัพธ์ของการต่อสมาชิก array ได้ดังนี้")

print(np.concatenate((d,e)))

print("----------------------------------")

#ทดลองใช้ append คือ การเพิ่มสมาชิกมาต่อท้าย array
#เช่นอยากเอา 100 มาต่อท้าย array a

print("ดูข้อมูลใน array ได้ดังนี้")
print(a)

print("----------------------------------")

print("ผลลัพธ์ของการเพิ่มสมาชิก array ได้ดังนี้")

print(np.append(a,100))

print("----------------------------------")
#ลองเพิ่ม 500 เข้าไป แล้วดูผลลัพธ์อีกครั้ง
#เขียนแบบนี้ัก้ได้

a = np.append(a,500)
print(a)
print("----------------------------------")
#ลองดูสมาชิก array a อีกครั้ง ว่ามีการเปลี่ยนแปลงหรือไม่

print("ดูข้อมูลใน array ได้ดังนี้")
print(a)

print("----------------------------------")
#อยากเอา 1000 มาต่อท้าย array a

print("ผลลัพธ์ของการเพิ่มสมาชิก array ได้ดังนี้")

print(np.append(a,1000))

print("----------------------------------")

#แบบ array 2 มิติ 

f = np.array([[1,2],[3,4]])

#ดูข้อมูลใน array ได้ดังนี้
print("ดูข้อมูลใน array ได้ดังนี้")
print(f)

print("----------------------------------")
#ผลลัพธ์ของการต่อสมาชิก array ได้ดังนี้

print("ผลลัพธ์ของการต่อสมาชิก array ได้ดังนี้")

print(np.concatenate((f,f)))
print("----------------------------------")

#อยากเอาเลข 10 ,20  ต่อท้าย array f   

print("ผลลัพธ์ของการเพิ่มสมาชิก array ได้ดังนี้ เพิ่มมาต่อแนวนอน")
print(np.append(f,[[10],[20]],axis=1)) #อยากมาต่อแบบแนวนอน ให้กำหนด axis=1 ,อยากมาต่อแบบแนวตั้ง ให้กำหนด axis=0

print("----------------------------------")
#np.append คือการเพิ่มสมาชิกมาต่อท้าย array (array ที่เราจะทำงาน,สมาชิกที่เราจะเพิ่มมาต่อท้าย)

