#ชนิดข้อมูล 

import numpy as np #เรียกใช้ numpy แล้วตั้งชื่อ numpy เป็น np

a = np.array([1,2,3,4,5])#array 1 มิติ
#เช็คชนิดข้อมูล
print(a.dtype)

print("----------------------------------------------------------")
#รูปแบบ ที่ 2 แบบระบุ ชนิดข้อมูล

#รูปแบบint
print(np.array([1,2,3,4,5],dtype = "int"))
#หรือเขียนแบบนี้ก็ได้
print(a.astype('int'))  # แปลงชนิดข้อมูลของ array `a` เป็น int16
#หรือเขียนแบบนี้ก็ได้
a=np.array([1,2,3,4,5],dtype = "int")
print(a)
print(a.dtype)

print("----------------------------------------------------------")


#รูปแบบfloat
print(np.array([1,2,3,4,5],dtype = "float"))
#ผลลัพธ์ จะเป็น [1. 2. 3. 4. 5.] , 1.0มันก็คือ 1.0 นั้นแหละแค่ไม่เขียนเลข 0
#หรือเขียนแบบนี้ก็ได้
a= np.array([1,2,3,4,5],dtype = "float")
print(a)
print(a.dtype)#เช็คชนิดข้อมูล

print("----------------------------------------------------------")

#รูปแบบstr
print(np.array([1,2,3,4,5],dtype = "str"))
#ผลลัพธ์ จะเป็น ['1' '2' '3' '4' '5']
#หรือเขียนแบบนี้ก็ได้
a= np.array([1,2,3,4,5],dtype = "str")
print(a)
print(a.dtype)

print("----------------------------------------------------------")

#รูปแบบboolean
print(np.array([1,2,3,4,5],dtype = "bool"))
#ผลลัพธ์ จะเป็น [ True  True  True  True  True]
#หรือเขียนแบบนี้ก็ได้
a= np.array([1,2,3,4,5],dtype = "bool")
print(a)
print(a.dtype)

print("----------------------------------------------------------")

#รูปแบบcomplex
print(np.array([1,2,3,4,5],dtype = "complex"))
#ผลลัพธ์ จะเป็น [1.+0.j 2.+0.j 3.+0.j 4.+0.j 5.+0.j]
#หรือเขียนแบบนี้ก็ได้
a= np.array([1,2,3,4,5],dtype = "complex")
print(a)
print(a.dtype)

print("----------------------------------------------------------")

#รูปแบบobject
print(np.array([1,2,3,4,5],dtype = "object"))
#ผลลัพธ์ จะเป็น [1, 2, 3, 4, 5]
#หรือเขียนแบบนี้ก็ได้
a= np.array([1,2,3,4,5],dtype = "object")
print(a)
print(a.dtype)

print("----------------------------------------------------------")                                                                   