#การเข้าถึงสมาชิก Array 3 มิติ 

import numpy as np
a =np.array([[[1,2,3],[4,5,6]]]) #ดูที่จำนวน bracket นั้นก็เป็น array 3 มิติ
print(a.ndim) #เช็คว่า array นั้นเป็น array 3 มิติหรือไม่
print(a) #แสดง array

#[[[1,2,3]
#  [4,5,6]]]  #braket ดูว่าชั้นนอกสุดมีกี่ชั้น มี 1 ชั้น เลยเรียกชั้นที่ 0 , มี 2 ชั้น เลยเรียกแถวที่ 1 , มี 3 ชั้น เลยเรียกคอลัมน์ที่ 2  

#****อธิบาย คือ เดิมที่มัน คือ array 2 มิติ ซ้อนกัน แบบนี้ คือ array 2 มิติ [[1,2,3]]
# จะทำให้เป็น array 3 มิติ [[[[1,2,3]]]]  คือเพิ่ม braket ครอบเข้าเพิ่มอีก โดยเป็น array 3 มิติ แบบที่ยกตัวอย่าง คือความลึก มี 1ชั้น
#ให้ดูที่ braket นอกเนื่องที่เป็นโครงสร้าง array 2 มิติ คือแบบนี้ [[1,2,3],[4,5,6]] 
#จะทำให้เป็น array 3 มิติ [[[[1,2,3],[4,5,6]]]] คือครอบเพิ่มbraket อีก []อีก1 ข้างนอก จะเป็น array 3 มิติแบบความลึก มี 1 ชั้น
#เป็น a[depth][row][column] ได้เป็น a[0][][] เพราะมี 1 ชั้น คือ index ชั้นที่ 0  ถ้าเพิ่มเข้ามาละ
#([[[1,2,3],[4,5,6]],[[7,8,9],[10,11,12]]]) เป็น array 3 มิติ ความลึก 2 ชั้น ,a[1][][]  
# #เช่น อยากได้เลข 5 ,depth = 0 , row = 1 , column = 1 ,[4,5,6]]] 
# แต่ถ้าอยากได้เลข 9 ,depth = 1 , row = 0 , column = 2 ,[7,8,9]
# แต่ถ้าอยากได้เลข 12 ,depth = 1 , row = 1 , column = 2 ,[10,11,12] *********


#การเข้าถึงสมาชิก Array 3 มิติ , a[depth][row][column] คือ a[ความลึก][แถว][คอลัมน์]

#เช่นอยากได้เลข 5 ,depth = 0 , row = 1 , column = 1 ,[4,5,6]]] 
print(a[0][1][1])

print(a[0][0][0]) #อยากได้เลข 1
print(a[0][0][1]) #อยากได้เลข 2
print(a[0][0][2]) #อยากได้เลข 3

#หรือแบบ index ติดลบก็ได้
print(a[0][0][-1]) #อยากได้เลข 3
print(a[0][-1][-1]) #อยากได้เลข 6

#กรณีมีความลึกมากกว่า 1 ชั้น
b=np.array([[[1,2,3],[4,5,6]],[[7,8,9],[10,11,12]]]) #สร้าง array 3 มิติ ,ความลึก 2 ชั้น
print(b.ndim) #เช็คว่า array นั้นเป็น array 3 มิติหรือไม่
print(b)#แสดง array

print(b[0][0][0]) #อยากได้เลข 1
print(b[0][0][1]) #อยากได้เลข 2
print(b[0][0][2]) #อยากได้เลข 3
#อยากได้เลข 8 
print(b[1][0][1])
print(b.shape)#แสดงขนาดของ array ,เช่น (2,2,3) คือ 2 ชั้น 2 แถว 3 คอลัมน์