# #Slice Array 2 มิติ **************
# #การเข้าถึงข้อมูลสมาชิกภายใน array แบบ slice
# #x[start : stop : step]
#print(x[ตั้งแต่แถวที่ต้องการ : แถวที่่เลือก , ตั้งแต่คอลัมที่ต้องการ : คอลัมที่่เลือก]) ******


import numpy as np #เรียกใช้ numpy 

x =np.array([[1,2,3], #row 0
            [4,5,6], #row 1
            [7,8,9]])#สร้าง array 2 มิติ ,row 2
print(x)
print("----------------------------------------------------------")

# #การเข้าถึงข้อมูลมาชิกภายใน array 2 มิติ แบบ slice
# #มีทั้งหมด 5 รูปแบบ
# #1.แบบไม่ระบุค่าอะไรเลย
print(x[:,:]) #x[:,:] #แบบที่ 1 ,มันจะแสดงข้อมูลทั้งหมด

#print(x[ตั้งแต่แถวที่ต้องการ : แถวที่่เลือก , ตั้งแต่คอลัมที่ต้องการ : คอลัมที่่เลือก]) ******
print("แสดงข้อมูลทั้งหมด")
print("แสดงแบบที่ 1")

print("----------------------------------------------------------")

# #2.แบบระบุค่าเริ่มต้น x[start(ของ row):,start(ของ column): ]
print(x[1:,1:]) #x[1:,1:] #แบบที่ 2 ,มันจะแสดงข้อมูลตั้งแต่สมาชิกที่ 1 ถึงสมาชิกสุดท้าย
print(x[2:,2:])#อยากได้เลข  9
# #อยากได้เลข 8 ,9
print(x[2:,1:])
# #เอาเฉพาะคอลัมที่ 2
print(x[:,2:])
print("แสดงแบบที่ 2")
print("----------------------------------------------------------")

# #3.แบบระบุค่าสิ้นสุด x[ stop(ของ row),: stop(ของ column)]
print(x[:2,:2]) #x[:2,:2] #แบบที่ 3 ,มันจะแสดงข้อมูลตั้งแต่สมาชิกแรกถึงสมาชิกที่ 2
# #เอาเฉพาะแถวที่ 2
print(x[:2,:])
# #เอาเลขที่ 1 - 6
print(x[:2,:])
# #อยากได้แถวที่ 0 และแถวที่ 1 แต่เอาเฉพาะคอลัมที่ 2 คือ [[3], [6]]
print(x[:2,2:])
print("แสดงแบบที่ 3")


print("----------------------------------------------------------")

# #4.แบบระบุค่าเริ่มต้นและสิ้นสุด x[start(ของ row) : stop(ของ row) , start(ของ column): stop(ของ column)]
print(x[1:2:1,1:2:1]) #จะได้เลข 5

print("แสดงแบบที่ 4")
print("----------------------------------------------------------")
# #5.แบบระบุค่าเริ่มต้นและสิ้นสุดและระบุ step 
# # , x[start(ของ row): stop(ของ row) : step(ของ row) , start(ของ column): stop(ของ column) : step(ของ column)]
# #อยากได้แถวเดียวและคอลัมเดียว


print("แสดงแบบที่ 5")
print("----------------------------------------------------------")