#การเข้าถึงสมาชิก Array 2 มิติ 

#เรียกใช้ numpy ในการสร้าง array หรือ มันคือ Numpy array
import numpy as np #ตั้งชื่อ numpy เป็น np

#ยกตัวอย่างการเข้าถึง index ใน array 1 มิติ

a = np.array([1,2,3,4,5]) #สร้าง array 1 มิติ
#แล้วต้องเอา 100 ไปยัดลงใน index 2
a[2] = 100
print(a) #มันจะเป็น [1 2 100 4 5] มันจะเอา index 2 มาแทนด้วย 100 แทนที่เลย

#เข้าถึงสมาชิกใน array 2 มิติ ******

b = np.array([[1,2],[3,4],[5,6]])#สร้าง array 2 มิติ
print(b)

# [[1,2],
#  [3,4],
#  [5,6]]
#rol 0 = [1,2] ,rol -3 = [1,2]
#rol 1 = [3,4] ,rol -2 = [3,4]
#rol 2 = [5,6] ,rol -1 = [5,6]
#col 0 = [1,3,5] ,col -2 = [1,3,5]
#col 1 = [2,4,6]  ,col -1 = [2,4,6]

#อยากเข้าถึงเลข 4 ใช้คำสั่ง ว่า b[rol][col]

print(b[1][1],"(อยากได้เลข 4)")
#ทำแบบ index ติดลบก็ได้

print(b[-2][-1],"(อยากได้เลข 4)")

print(b[-1][-2],"(อยากได้เลข 5)")

#อยาก 500 มายัดใส่ index rol 0 col 1 ใช้คำสั่ง ว่า b[rol][col]

b[0][1] = 500
print(b)

#ลองสร้างแบบ เลขเยอะๆ
c =np.array([[1,2,3],[4,5,6],[7,8,9]])
print(c)

print(c[1][2],"(อยากได้เลข 6)")
print(c[-1][-1],"(อยากได้เลข 9)")
#อยากได้เลข 8 
print(c[2][1],"(อยากได้เลข 8)")