#Reshape & Resize
#การเปลี่ยนแปลงรูปแบบของ array
#คือจัดเรียงสมาชิกของ array ให้มีขนาดมิติตามที่กำหนดโดยใช้คำสั่ง reshape หรือ resize

import numpy as np #เรียกใช้ numpy ในการสร้าง array หรือ มันคือ Numpy array

#reshape คือเปลี่ยนแปลงรูปแบบหรือเปลี่ยนแปลงโครงสร้างของ array แบบชั่วคราว
#resize คือเปลี่ยนแปลงรูปแบบหรือเปลี่ยนแปลงโครงสร้างของ array แบบถาวร ****************************

#สร้างarray 1 มิติ
a =np.arange(10)
print(a)

print("-------------------")

#แบบ reshape

#อยากเปลี่ยนแปลงรูปแบบของ array ชื่อa ให้เป็น 2 มิติ มีขนาด 2 แถว และ 5 คอลัมน์ 

print(a.reshape(2,5))

print("-------------------")

print(a)

print("-------------------")

#หรือ ใช้แบบนี้ก็ได้ ,มันคือเปลี่ยนค่าในตัวแปร a ถาวร ตามที่เราอยากเปลี่ยนโดยให้เก็บค่าในตัวแปร b ก่อนหน้าคือเปลี่ยนค่าชั่วคราว
b = a.reshape(2,5)
print(b)

print("-------------------")

print("ดูค่าในตัวแปร a และ b")
print(a)
print("\n")
print(b)

#แบบ resize
#อยากเปลี่ยนแปลงรูปแบบของ array ชื่อa ให้เป็น 2 มิติ มีขนาด 2 แถว และ 5 คอลัมน์ 
a.resize(2,5)
print(a)

print("-------------------")

print("ดูค่าในตัวแปร a และ b")
print(a)
print("\n")
print(b)


